'use client'
import { BsChevronRight } from 'react-icons/bs';
import style from './Questions.module.css'
import { useRouter } from 'next/navigation';
import { HiChevronDown, HiChevronUp } from 'react-icons/hi2';
import { useState } from 'react';

function Questions() {
    const router = useRouter()
    const qustions = [
        { title: 'رزرو نوبت جلسات حضوری هم دارد؟', ansver: 'خیر، کلیه خدمات پل به صورت تماس تصویری و آنلاین برگزار می‌شود.', category: '' },
        { title: 'جلسات مشاوره سازمانی آنلاین هستند یا حضوری؟', ansver: 'جلسات مشاوره سازمانی و ورکشاپ‌های پُل به 2 صورت آنلاین و حضوری برگزار می‌شوند.', category: '' },
        { title: 'آیا مشاورین حاضر در برنامه مورد تایید دکتر صاحبی هستند؟', ansver: 'بله، تمام افرادی که در مجموعه پُل کار می‌کنند مورد تایید دکتر صاحبی هستند و تحت نظارت مستقیم ایشان فعالیت دارند.', category: '' },
        { title: 'آیا مشاورین حاضر در برنامه مورد تایید دکتر صاحبی هستند؟', ansver: 'بله، تمام افرادی که در مجموعه پُل کار می‌کنند مورد تایید دکتر صاحبی هستند و تحت نظارت مستقیم ایشان فعالیت دارند.', category: '' },
        { title: 'جلسات مشاوره سازمانی آنلاین هستند یا حضوری؟', ansver: 'جلسات مشاوره سازمانی و ورکشاپ‌های پُل به 2 صورت آنلاین و حضوری برگزار می‌شوند.', category: '' },
        { title: 'رزرو نوبت جلسات حضوری هم دارد؟', ansver: 'خیر، کلیه خدمات پل به صورت تماس تصویری و آنلاین برگزار می‌شود.', category: '' },
        { title: 'جلسات مشاوره سازمانی آنلاین هستند یا حضوری؟', ansver: 'جلسات مشاوره سازمانی و ورکشاپ‌های پُل به 2 صورت آنلاین و حضوری برگزار می‌شوند.', category: '' },
        { title: 'آیا مشاورین حاضر در برنامه مورد تایید دکتر صاحبی هستند؟', ansver: 'بله، تمام افرادی که در مجموعه پُل کار می‌کنند مورد تایید دکتر صاحبی هستند و تحت نظارت مستقیم ایشان فعالیت دارند.', category: '' },
        { title: 'آیا مشاورین حاضر در برنامه مورد تایید دکتر صاحبی هستند؟', ansver: 'بله، تمام افرادی که در مجموعه پُل کار می‌کنند مورد تایید دکتر صاحبی هستند و تحت نظارت مستقیم ایشان فعالیت دارند.', category: '' },
        { title: 'جلسات مشاوره سازمانی آنلاین هستند یا حضوری؟', ansver: 'جلسات مشاوره سازمانی و ورکشاپ‌های پُل به 2 صورت آنلاین و حضوری برگزار می‌شوند.', category: '' },
        { title: 'آیا مشاورین حاضر در برنامه مورد تایید دکتر صاحبی هستند؟', ansver: 'بله، تمام افرادی که در مجموعه پُل کار می‌کنند مورد تایید دکتر صاحبی هستند و تحت نظارت مستقیم ایشان فعالیت دارند.', category: '' },
        { title: 'آیا مشاورین حاضر در برنامه مورد تایید دکتر صاحبی هستند؟', ansver: 'بله، تمام افرادی که در مجموعه پُل کار می‌کنند مورد تایید دکتر صاحبی هستند و تحت نظارت مستقیم ایشان فعالیت دارند.', category: '' },
        { title: 'جلسات مشاوره سازمانی آنلاین هستند یا حضوری؟', ansver: 'جلسات مشاوره سازمانی و ورکشاپ‌های پُل به 2 صورت آنلاین و حضوری برگزار می‌شوند.', category: '' },
        { title: 'آیا مشاورین حاضر در برنامه مورد تایید دکتر صاحبی هستند؟', ansver: 'بله، تمام افرادی که در مجموعه پُل کار می‌کنند مورد تایید دکتر صاحبی هستند و تحت نظارت مستقیم ایشان فعالیت دارند.', category: '' },
        { title: 'جلسات مشاوره سازمانی آنلاین هستند یا حضوری؟', ansver: 'جلسات مشاوره سازمانی و ورکشاپ‌های پُل به 2 صورت آنلاین و حضوری برگزار می‌شوند.', category: '' },
        { title: 'جلسات مشاوره سازمانی آنلاین هستند یا حضوری؟', ansver: 'جلسات مشاوره سازمانی و ورکشاپ‌های پُل به 2 صورت آنلاین و حضوری برگزار می‌شوند.', category: '' },
        { title: 'رزرو نوبت جلسات حضوری هم دارد؟', ansver: 'خیر، کلیه خدمات پل به صورت تماس تصویری و آنلاین برگزار می‌شود.', category: '' },
        { title: 'جلسات مشاوره سازمانی آنلاین هستند یا حضوری؟', ansver: 'جلسات مشاوره سازمانی و ورکشاپ‌های پُل به 2 صورت آنلاین و حضوری برگزار می‌شوند.', category: '' },
    ]
    const [indexAnsDis, setindexAnsDis] = useState(0)
    return (
        <div className="custom-container" >
            <div className={style.headPage} >
                <BsChevronRight onClick={() => router.back()} />
                <span>سوالات متداول</span>
            </div>
            <div className={style.AllQuestions} >
                {qustions.map((qus, index) => {
                    return (
                        <div className={style.qestion} key={index} >
                            <li onClick={() => {
                                if (index + 1 !== indexAnsDis) {
                                    setindexAnsDis(index + 1)
                                } else {
                                    setindexAnsDis(0)
                                }
                            }} >  {qus.title}  {index + 1 !== indexAnsDis ? <HiChevronDown /> : <HiChevronUp />}  </li>
                            {index + 1 === indexAnsDis && <p onClick={() => setindexAnsDis(0)}> {qus.ansver} </p>}
                        </div>
                    )
                })

                }
            </div>
        </div>
    );
}

export default Questions;